/**
 * Иконка сортировки по алфавиту по возрастанию (SortAlphaAscIcon).
 *
 * @param {React.SVGProps<SVGSVGElement>} props - Свойства SVG (например, className, style и т.п.)
 * @returns {JSX.Element}
 */
export const SortAlphaAscIcon = ({ ...props }) => {
  return (
    <svg
      xmlns="http://www.w3.org/2000/svg"
      width={props.width ?? 24}
      height={props.height ?? 24}
      viewBox="0 0 24 24"
      {...props}
    >
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M6.95 3.75a.75.75 0 0 1 .75.75v13.046l2.743-3.048a.75.75 0 1 1 1.114 1.004l-4.05 4.5a.75.75 0 0 1-1.12-.007l-3.95-4.5a.75.75 0 0 1 1.127-.99L6.2 17.51V4.5a.75.75 0 0 1 .75-.75Z"
      />
      <path d="m16.848 6.807-.204.734h1.486l-.205-.734a32.56 32.56 0 0 1-.276-.981l-.249-1h-.036c-.077.336-.16.672-.249 1.009-.083.33-.172.654-.267.972ZM14.9 10l1.895-6h1.21l1.895 6h-1.085l-.454-1.624h-1.957L15.95 10H14.9ZM18.47 20v-2.349h-.777L16.466 20H15.4l1.403-2.486a1.634 1.634 0 0 1-.794-.597c-.203-.287-.304-.666-.304-1.137 0-.447.085-.798.256-1.055a1.4 1.4 0 0 1 .69-.56c.293-.11.622-.165.986-.165H19.4v6h-.93Zm-.737-3.193h.737v-1.954h-.737c-.358 0-.634.07-.826.211-.187.135-.28.373-.28.716 0 .685.368 1.027 1.106 1.027Z" />
    </svg>
  );
};
